/////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////
///  SEMINAR - 5    Функции и одномерные массивы
/////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////
/*
 double x = 1.8976972367;
 Console.WriteLine(Math.Round(x, 2));
*/
/*
Random x = new Random();
double y = x.NextDouble();
Console.WriteLine(Math.Round(y, 2));
*/


////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
/////Задача 31: Задайте массив из 12 элементов, заполненный случайными чисалми из промежутка [-9, 9]. 
/////         Найдите сумму отрицательных и положительных элементов массива.
/////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////

// ------------------ ОСНОВА---------------------- //
//   ФОРМИРОВАНИЕ МАССИВА КОТ  БУДЕТ РАБОТАТЬ С ПРОГРАММОЙИ ПРОГРАММА БУДЕТ РАБОТАТЬ С НИМ //
/*
Console.Clear();

int[] array = GetArray(12, -9, 9);

Console.WriteLine();

Console.WriteLine($"[{String.Join(", ", array)}]");

int positiveSum = 0; // сумма положительных и отрицательных значений
int negativeSum = 0; // сумма положительных и отрицательных значений

//   И ДЕЛАЕМ ПОДСЧЕТ ПОЛОЖИТЕЛЬНЫХ И ОТРИЦАТЕЛЬНЫХ ЭЛЕМЕНТОВ //

foreach (int el in array )
    {
        if ( el > 0)
            {
                positiveSum += el;
            }
        else
            {
                negativeSum += el;
            }
    }

Console.WriteLine();

Console.WriteLine($"Сумма положительных: {positiveSum}, сумма отрицательных: {negativeSum}");

Console.WriteLine();


// ------------------ МЕТОД ЗАПОЛНЕНИЯ МАССИВА ---------------------- //

int[] GetArray(int size, int minValue, int maxValue)
{
    int[] result = new int [size];

    for (int i=0; i < size; i++)
    {
        result[i] = new Random().Next(minValue, maxValue + 1 );
    }
    return result;

}

*/


////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
///// Задача 32: напишите программу замены элементов массива: положительные элементы замените на соответствующие отприцательные и наоборот  
///// [-4, -8, 8, 2] --> [4, 8, -8, -2]
/////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////

/*
Console.Clear();

// int[] mas = new int[] {-4, -8, 8, 2} ;
int[] mas = new int [] {4, 8, -8, -2} ;
Console.WriteLine($"[{String.Join(", ", GetArray(mas))}]");
//Console.WriteLine($"[{String.Join(", ",  mas)}]");

//------------------------МЕТОД---------------------------------//
int[] GetArray (int[] array) 
{
    int[] arr = new int[array.Length];
    for ( int i = 0; i < array.Length; i++ )
    {
        array[i] = -array[i];
    }
    return array;
}

*/

 ////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
///// Задача 33: Задайте массив. Напишите программу, котораяя определяет, присутствует ли заданное число в массиве.
/////
///// 4; в массиве [6, 7, 19, 345, 3] --> нет
///// 3; в массиве [6, 7, 19, 345, 3] --> да

/////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////

 Console.Clear();
