// Однострочный комментарий
//Console.WriteLine("Hello!");
/*
многострочный комментарий
22
222
222
*/

// 111
// 11
// 1

//Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное на само себя)

// Вариант 1

// Console.WriteLine("Ведите чило: ");
// int number = int.Parse(Console.ReadLine()!);
// int sqr = number * number;
// Console.WriteLine($"Квадрат числа {number} = {sqr}");

// Вариант 2

// Console.WriteLine("Ведите чило: ");
// int number = int.Parse(Console.ReadLine()!);
// int sqr1 = Convert.ToInt32(Math.Pow(number, 2));
// Console.WriteLine($"Квадрат числа {number} = {sqr1}");

// Задание: Вывести все целые числа от -N до N

// Console.WriteLine("Ведите чило: ");
// int N = int.Parse(Console.ReadLine()!);
// int N2 = - N;

// while (N2 <= N)
// {
//     Console.Write($"{N2} ");
//     N2++;
// }
