// Однострочный комментарий
//Console.WriteLine("Hello!");
/*
многострочный комментарий
22
222
222
*/

// 111
// 11
// 1

//Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное на само себя)

// Вариант 1

// Console.WriteLine("Ведите чило: ");
// int number = int.Parse(Console.ReadLine()!);
// int sqr = number * number;
// Console.WriteLine($"Квадрат числа {number} = {sqr}");



