// Урок 8. Двумерные массивы. Продолжение


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задача 54: Задайте двумерный массив. Напишите программу, которая упорядочит по убыванию элементы каждой строки двумерного массива.
// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// В итоге получается вот такой массив:
// 7 4 2 1
// 9 5 3 2
// 8 4 4 2
 /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
 /*
 // ------------------------------// ------------------------------// ------------------------------
         Console.WriteLine("// ------------------------------// ------------------------------//");
            Console.Write("Введите размерность массива:\n r=");
            int r = int.Parse(Console.ReadLine()!);
            Console.Write(" c=");
            int c = int.Parse(Console.ReadLine()!);

            int[,] arr = new int[r, c];
// ------------------------------// ------------------------------// ------------------------------
            Console.WriteLine("// ------------------------------// ------------------------------//");
            Console.WriteLine("Наполнение массива случайныви числами");
            Random rnd = new Random();
            for (int i = 0; i < arr.GetLength(0); i++)
            {
                for (int j = 0; j < arr.GetLength(1); j++)
                {
                    arr[i, j] = rnd.Next(1, 9);
                }
            }
             
// ------------------------------// ------------------------------// ------------------------------
            Console.WriteLine("\nИсходный массив:");
            Console.WriteLine( );
             for (int i = 0; i < arr.GetLength(0); i++, Console.WriteLine())
             {
                for (int j = 0; j < arr.GetLength(1); j++)
                    {
                        // Console.Write( $" {arr[i, j]}");
                         Console.Write("{0, 5}", arr[i, j]);
                    }
             }

// ------------------------------// ------------------------------// ------------------------------
 
 

 //сортируем
            for ( int i = 0; i < arr.GetLength(0); i++) // строки массива
                
                //сортировка пузырьком

                for (int j = 0; j < arr.GetLength(1); j++) // столбцы массива

                    for (int k = 0; k < arr.GetLength(1); k++) // перебор  столбцов по строке массива
                        {
                            if (arr[i, j]  < arr[i, k]) 
                                {
                                    continue;
                                }
                            else    
                                {
                                    int temp = arr[i, j];
                                    arr[i, j] = arr[i, k];
                                    arr[i, k] = temp;
                                }
                            
                                
                        }

 // печать отсортированного массива
 Console.WriteLine("печать отсортированного массива");
for (int i = 0; i < arr.GetLength(0); i++, Console.WriteLine())
             {
                for (int j = 0; j < arr.GetLength(1); j++)
                    {
                        // Console.Write( $" {arr[i, j]}");
                         Console.Write("{0, 5}", arr[i, j]);
                    }
             }
           
*/
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задача 56: Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов.

// Например, задан массив:

// 1 4 7 2

// 5 9 2 3

// 8 4 2 4

// 5 2 6 7
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
 Console.Clear();

// ------------------------------// ------------------------------// ------------------------------//
         Console.WriteLine("// ------------------------------// ------------------------------//");
            Console.Write(" Введите размерность массива. \n Массив должен быть квадратным т.е. r=c :\n r=");
            int r = int.Parse(Console.ReadLine()!);
            Console.Write(" c=");
            int c = int.Parse(Console.ReadLine()!);
            int[,] arr = new int[r, c];
// ------------------------------// проверяем квадратность массива// ------------------------------//
 
if (r == c )
{
  
}
else
{
Console.Write(" Массив должен быть квадратным. опробуй еще раз !");    
return;
}

// ------------------------------// Наполнение массива случайныви числами// ------------------------------//                
             
            Console.WriteLine("\n Наполнение массива случайныви числами");
            Random rnd = new Random();
            for (int i = 0; i < arr.GetLength(0); i++)
            {
                for (int j = 0; j < arr.GetLength(1); j++)
                {
                    arr[i, j] = rnd.Next(1, 9);
                }
            }
             
// ------------------------------//Исходный массив// ------------------------------ //
            Console.WriteLine("\n Исходный массив:");
            Console.WriteLine( );
             for (int i = 0; i < arr.GetLength(0); i++, Console.WriteLine())
             {
                for (int j = 0; j < arr.GetLength(1); j++)
                    {
                       // Console.Write( $" {arr[i, j]}");
                         Console.Write("{0, 5}", arr[i, j]);
                    }
                    Console.WriteLine();
             }

// ------------------------------// ------------------------------// ------------------------------//
 // ищем сумму строк и записываем результат в одномерный массив

int [] ArrSum = new int[r]; // длинна массива равна количеству строк в 2 мерном массиве
Console.WriteLine($" \n ArrSumLength ={ArrSum.Length}");

int summ = 0; // сумма элементов в строке 

for ( int i = 0; i < r; i++) // строки массива
                { 
                     
                for (int j = 0; j < c; j++) // столбцы массива
                {

                    summ  = summ + arr[i, j]; // суммируем элементы в строке

                }
                  ArrSum [ i ] = summ; //пишем сумму в массив
                  Console.Write ($" \n ArrSum  {i} = {ArrSum [ i ]}");


                    summ = 0; // обнуляем сумму перед следующей итерацией
                }

 int min = 0; // индекс строки с минимальным значением

 for ( int i=0; i < ArrSum.Length; i++)
    {
        if ( ArrSum[i] < ArrSum[min])
            {
                min = i;
            }

    }   
    Console.WriteLine(" \n\n Номер строки с минимальной  суммой элементов: "+min);
   
   */

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//    Задача 58: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.
// Например, даны 2 матрицы:
// 2 4 | 3 4
// 3 2 | 3 3
// Результирующая матрица будет:
// 18 20
// 15 18
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
int[,] arr1 = new int[2, 2] {{2, 3}, {4,2}};
int[,] arr2 = new int[2, 2] {{3, 3}, {4,3}};
int[,] arr3 = new int[2, 2];

for (int i=0; i < arr1.GetLength(0); i++)
{
    for (int j=0; j < arr2.GetLength(1); j++)
    {
        for (int k=0; k < arr3.GetLength(1); k++)
        {
           arr3[i,j] = arr1[i,k] * arr2[k,j];
        }
    }

}

for (int i = 0; i < arr3.GetLength(0); i++)
   for (int j = 0; j < arr3.GetLength(1); j++)
   {
      arr3[i, j] = 0;
      for (int k = 0; k < arr1.GetLength(1); k++)
         arr3[i, j] += arr1[i, k] * arr2[k, j];
   }
                

Console.WriteLine("arr1");
for (int i = 0; i < arr1.GetLength(0); i++)
                {
                    for (int j = 0; j < arr1.GetLength(1); j++)
                   {
                    Console.Write(arr1[j, i]);
                    Console.Write('\t');
                   }
                Console.WriteLine();
               }


Console.WriteLine("arr2");
               for (int i = 0; i < arr2.GetLength(0); i++)
                {
                    for (int j = 0; j < arr2.GetLength(1); j++)
                   {
                    Console.Write(arr2[j, i]);
                    Console.Write('\t');
                   }
                Console.WriteLine();
               }


Console.WriteLine("arr3");
for (int i = 0; i < arr3.GetLength(0); i++)
                {
                    for (int j = 0; j < arr3.GetLength(1); j++)
                   {
                    Console.Write(arr3[j, i]);
                    Console.Write('\t');
                   }
                Console.WriteLine();
               }
*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задача 60. ...Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, 
// добавляя индексы каждого элемента.
// Массив размером 2 x 2 x 2
// 66(0,0,0) 25(0,1,0)
// 34(1,0,0) 41(1,1,0)
// 27(0,0,1) 90(0,1,1)
// 26(1,0,1) 55(1,1,1)

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*

int[,,] array= new int [2, 2, 2];
int d = 0; 
for (int i = 0; i < array.GetLength(0); i++)
{
   
    for (int j = 0; j < array.GetLength(1); j++)
    {
         
        for (int k = 0; k < array.GetLength(2); k++)
            {
                array[i,j,k] = new Random().Next(10, 99);
                Console.Write($"\t {array[i, j, k]} ( {i}, {j}, {k}) ");
                d=d+1;
                if (d % 2 == 0)
              {
                 Console.WriteLine();
              }
            }
 
    }
    
}

*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Задача 62. Напишите программу, которая заполнит спирально массив 4 на 4.
// Например, на выходе получается вот такой массив:

// 01 02 03 04
// 12 13 14 05
// 11 16 15 06
// 10 09 08 07

 
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
 
    int[,] result = new int[4, 4];

    int pos = 1;
    int count = 4;
    int value = -4;
    int sum = -1;

    do {
        value = -1 * value / 4;
        for (int i = 0; i < count; i++) 
        {
            sum += value;
            result[sum / 4, sum % 4] = pos++;
        }
        value *= 4;
        count--;
        for (int i = 0; i < count; i++) 
            {
            sum += value;
            result[sum / 4, sum % 4] = pos++;
            }
    } while (count > 0);

    int n = (result.GetLength(0) *result.GetLength(1) - 1).ToString().Length + 1;

    for (int i = 0; i < result.GetLength(0); i++) 
    {
        for (int j = 0; j < result.GetLength(1); j++) 
        {
            Console.Write(result[i, j].ToString("D2").PadLeft(n, ' '));
        }
        Console.WriteLine();
    }
*/