//////////////////////////////////////////////////////////////////////////////////////////////////////////
//  Задача 40: Напишите программу, которая принимает на вход три числа и проверяет, 
//  может ли существовать треугольник с сторонами такой длины. 
//  (Теорема о неравенстве треугольника: каждая сторона треугольника меньше суммы двух других сторон.)
//////////////////////////////////////////////////////////////////////////////////////////////////////////

int A, B, C;

Console.WriteLine("Введи сторону А:");
A = int.Parse(Console.ReadLine()!);

Console.WriteLine("Введи сторону B:");
B = int.Parse(Console.ReadLine()!);

Console.WriteLine("Введи сторону C:");
C = int.Parse(Console.ReadLine()!);

Console.WriteLine($"{Treugol(A, B, C)}");

bool Treugol ( int A, int B, int C)
{
     if ((A+B)) > C 
{
return true;
}
else
{
    return false;
}
}