// ДЗ К СЕМИНАРУ №5


//////////// не понимаю как вынести проверки в отдельные методы ////////////



////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. 
//            Напишите программу, которая покажет количество чётных чисел в массиве.

// [345, 897, 568, 234] -> 2
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/*
Console.Clear();

Console.WriteLine("Введи количество элементов массива");

int x= int.Parse(Console.ReadLine()!); // длина массива

int[] array1 = new int [x]; // задаем длину массива

Console.WriteLine("Введи 3х значные числа для элементов массива");


int count = 0; // для подсчет четных чисел

for ( int i=0; i < array1.Length; i++) // введение значений массива 
{
     
       array1[i] = int.Parse(Console.ReadLine()!);

        if (array1[i] % 2 == 0)  
        {
             count++;
        }


       int v =  array1[i];
       int a=0; // для подсчета кол-ва символово в числе
       while ( v > 0 ) // проверка элементов массива на 3х значность
       {
            a++;
            v /= 10;
       }

if (a>3 || a < 3 ) // остановка программы если число не 3х значное
        {
            Console.WriteLine("Ошибка! Число не трехзначное! Попробуйте снова!");
            break;
            
        }

}

Console.WriteLine($"Количество четных чисел в массиве {count}");

*/




 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// Задача 36: Задайте одномерный массив, заполненный случайными числами. 
//            Найдите сумму элементов, стоящих на нечётных позициях(индексы элементов должны быть нечетными(1,3,5 и тд)).

// [3, 7, 23, 12] -> 19

// [-4, -6, 89, 6] -> 0

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*
Console.Clear();

int y = 0;

Console.WriteLine("Введи количество элементов массива");

int x= int.Parse(Console.ReadLine()!); // длина массива

int[] array1 = new int [x]; // задаем длину массива

Console.WriteLine("Введите числа для элементов массива");

for ( int i=0; i < array1.Length; i++) // введение значений массива 
{
     
       array1[i] = int.Parse(Console.ReadLine ( )!);
     
          if ( i % 2 != 0)
               {
                    
                    y = y + array1[i];
                     
               }
}

Console.WriteLine ($"Сумма чисел на НЕчетных индексах массива равна: {y}");

*/
    



////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задача 37: Найдите произведение пар чисел в одномерном массиве. Парой считаем первый и последний элемент, второй и предпоследний и т.д. Результат запишите в новом массиве.

// [1 2 3 4 5] -> 5 8 3

// [6 7 3 6] -> 36 21
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
Console.Clear();

Console.WriteLine("Введи количество элементов массива №1 ");

int x = int.Parse(Console.ReadLine()!); // длина массива

int[] array1 = new int [x]; // задаем длину массива 1
Console.WriteLine($"Длинна массива №1 =  {array1.Length}");
int[] array2 = new int [x]; // задаем длину массива 2
Console.WriteLine($"Длинна массива №2 =  {array2.Length}");


/////////////////////////////////////////////////////////////////////////////////

Console.WriteLine("Задаем длину массива №3");

int j = x / 2;

int[] array3 = new int [j]; // задаем длину массива 3

Console.WriteLine($"Длинна массива №3 =  {j}");

if (x % 2 != 0)
{
     array3 = new int [(j+1)]; // задаем длину массива №3  если длина массива нечетная  
}
else 
     array3 = new int [j]; // задаем длину массива №3  если длина массива четная  

Console.WriteLine($"Длинна массива №3 после проверки  = {array3.Length}");

/////////////////////////////////////////////////////////////////////////////////

Console.WriteLine($"Введите {x} чисел для элементов массива №1 ");

for ( int i=0; i < array1.Length; i++) // введение значений массива №1
{
     array1[i] = int.Parse(Console.ReadLine ( )!);  
}

Console.WriteLine(String.Join(" ,", array1));
 
/////////////////////////////////////////////////////////////////////////////////

for ( int i=0; i < array2.Length; i++) // введение значений массива №2
{   
     array2[i] =  array1[array1.Length-(i+1) ] ;
}
Console.WriteLine(String.Join(" ,", array2));

/////////////////////////////////////////////////////////////////////////////////

Console.WriteLine(" Умножаем пары массива №1 и №2 и вносим значения в массив №3 : ");

for ( int i=0; i < array3.Length ; i++) // произведение пар двух массивов
{
     array3[i] = array1[i] * array2[i];  
     
}

Console.WriteLine(String.Join(", ", array3)  );

/////////////////////////////////////////////////////////////////////////////////

Console.WriteLine($"Убираем произведение непарного элемента если длина массива #3 нечетная ");
 int jj = array3.Length;

if (x%2 != 0)
{
     array3[jj-1] = array3[jj-1] / array1[jj-1];
}
else
     array3[jj-1] = array3[jj-1] ;

Console.WriteLine(String.Join(", ", array3)  );
 
/////////////////////////////////////////////////////////////////////////////////

*/

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Задача 38: Задайте массив целых чисел от -10 до 10. Найдите разницу между максимальным и минимальным элементов массива.
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/*
 
int[] array1 = new int [21];

int x = -11;

for ( int i=0; i != 21; i++)
{ 
       
     x = x + 1 ; 
     array1[i] = x;
     
     Console.Write ($"{x}\t");
     
}

Console.WriteLine();

int minArray = array1[0];

for (int i=0; i < array1.Length; i++)
{
     if (minArray < array1[i])
     {
          continue;
     }
     else
     {
          minArray = array1[i];
     }

}
Console.WriteLine();
Console.WriteLine($"Минимальное число массива {minArray}");

int maxArray = array1[0];

for (int i=0; i < array1.Length; i++)
{
     if (maxArray > array1[i])
     {
          continue;
     }
     else
     {
          maxArray = array1[i];
     }

}
Console.WriteLine();
Console.WriteLine($"Максимальное число массива {maxArray}");

int r = maxArray-minArray;

Console.WriteLine($"Разница между max={maxArray} и min={minArray} равна {r} ");

*/