///////////////////////////////////______________________________/////////////////////////////////// 
///////////////////////////////////___ДЗ К СЕМИНАРУ 3 C#_________/////////////////////////////////// 
///////////////////////////////////______________________________/////////////////////////////////// 
/////////////////////////////////////////////////////////////////////////////////////////////////
//   Логическое "И"  -   &&  (Одновременно выполняются) // if(n1 % 2 == 0 && 0 & n1 > 0)   else
//   Логическое "ИЛИ" -   ||  (Выполняется 1 из условий либо 2) //  if ( n1 % 2 = 0 || n1 > 0)  else 
///////////////////////////////////////////////////////////////////////////////////////////////////////
/*



////////
//////// Задача 19
////////

// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом 
// (первое число равно последнему, второе равно предпоследнему).

// 14212 -> нет

// 12821 -> да

// 23432 -> да

/*

Console.WriteLine ("Введите пятизначное число: ");

int number = int.Parse(Console.ReadLine()!);

string numberS = number.ToString();

if (numberS.Length != 5 )
{
    Console.WriteLine("Это не пятизначное число ");
}
else if (numberS[0] == numberS[4] && numberS[1] == numberS[3])
{
     Console.WriteLine("Данное число ПАЛИНДРОМ!");
}
else
{
    Console.WriteLine("Данное число НЕ палиндром!");
}

*/


////////
//////// Задача 21
////////

// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.

// A (3,6,8); B (2,1,-7), -> 15.84

// A (7,-5, 0); B (1,-1,9) -> 11.53

/*

//             xa ya za xb yb zb
//             0  1  2  3  4   5
// int[] mas = {3, 6, 8, 2, 1, -7};
int[] mas = {7, -5, 0, 1, -1, 9};

double masR = Math.Sqrt(Math.Pow(mas[3]-mas[0], 2) + Math.Pow(mas[4]-mas[1], 2)+ Math.Pow(mas[5]-mas[2], 2));

Console.WriteLine($"{masR:f2}");

*/



// Задача 23

// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

// 3 -> 1, 8, 27
// 5 -> 1, 8, 27, 64, 125

// */

/*

Console.WriteLine("Введите число!");
int num = int.Parse(Console.ReadLine()!);
if (num < 0)
{
    Console.WriteLine($"Преобразуем отрицательное число {-num}  в положительное {num} ");
    num =  -num;
    // num = -num;
}
for (int i = 1; i <= num ; i++ )
{
    Console.Write($"{Math.Pow(i, 3)} ");
}

*/











